legio-e/BasicPlus/bpgenvm-c/stm32/port/stm32_repl.c
/*
 * stm32_repl.c — REPL wire v1 bare-metal (H9.2 / H9.4).
 *
 * H9.2.a: HELLO/INFO/TIME/PING/RESET + LIST/DF/LOG → el IDE conecta.
 * H9.2.b: + FS en RAM (PUT/GET/DEL/STAT/LIST real/DF real/MKDIR/FORMAT) y
 *         RUN (carga el .mod del FS, lo ejecuta, hace streaming de OUTPUT y
 *         emite EXITED) → "Run on STM32" completo.
 * H9.2.c: RUN resuelve imports (carga <owner>.mod del FS, ≤4 pasadas) + guard.
 * H9.4:   al boot registra los backends de HW (GPIO + info de MCU) y
 *         pre-instala la stdlib core en /lib (stm32_mods_install) → los
 *         programas que importan stdlib resuelven y controlan pines reales.
 *
 * Single-thread, sin FreeRTOS. La salida del programa BP se reenvía como
 * eventos OUTPUT (bytes verbatim, escapados a JSON → paridad de contenido).
 */
#include "stm32_repl.h"
#include "stm32_wire.h"
#include "stm32_fs.h"
#include "board_mgr_stm32.h"  /* H9 — arranque escalonado + STATE/ENV/PART */
#include "flash_layout_stm32.h" /* BP_ENV_SECTOR: s_put_buf hace de scratch del env */
#include "bpvm_pack.h"        /* H3 — BPVM_PACK_BURN_CHUNK (bulk del PACK_BURN_DATA) */
#include "log.h"              /* log persistente de diagnóstico (espejo del Pico) */
#include "bpvm_fs.h"          /* H19 — base-dir / main module por proyecto */
#include "crc32.h"           /* paso 4 cierre — CRC por fichero en el LS */
#include "stm32_mods.h"     /* stdlib core embebida (pre-install /lib) */
#include "gpio_stm32.h"     /* stm32_hw_register (backends GPIO + Pico) */
#include "json_min.h"
#include "bpvm.h"
#include "bpvm_io.h"   /* V6/A1.5: el segundo hilo, comun a todas las familias */
#include "bpvm_internal.h"   /* recorrido de vm->modules[] para los .mdn del AOT */
#include "bpvm_entry.h"      /* #344 — el RUN, escrito una vez */
#include "bpvm_rtc.h"        /* H10 — TIME aplica la hora al RTC (bpvm_rtc_set_now_ms) */
#include "mdn_loader.h"      /* H9.5: overlay AOT .mdn desde el FS (loader compartido) */
#include "aot_registry.h"
#include "bpvm_repl.h"       /* V6/U3: los verbos COMUNES del REPL (grupo 1: meta) */
#include "bpvm_mem.h"        /* V6/U6.11: el planificador de memoria COMÚN (una regla, cinco placas) */
#include "bpvm_mods.h"       /* V6/U4: el bucle y la regla de la stdlib embebida, comunes */    /* H9.5: bpvm_aot_clear entre RUNs (registry global) */

#include "main.h"
#include "board.h"              /* placa: BOARD_WIRE_UART, BOARD_NAME, BOARD_SRAM_BYTES, BOARD_LED_* */

#include <string.h>
#include <stdio.h>

#define SERVER_NAME "bpvm-stm32"
/* BOARD_NAME, BOARD_SRAM_BYTES y los BOARD_LED_* los provee board.h (por placa). */

/* Buffers estáticos (NO en stack: el stack C del micro es pequeño). */
static char    s_line[WIRE_LINE_MAX];
/* #294/#334 — el buffer del bulk YA NO tiene que dar para el fichero entero:
 * desde que el IDE sube por trozos (PUT_BEGIN/DATA/END, verificado en placa en
 * las 3 familias el 28-jul) sólo necesita el MAYOR de sus dos papeles:
 *   (a) un trozo de streaming            = PUT_STREAM_CHUNK (16 KB)
 *   (b) el scratch del gestor de placa
 *
 * #338 (2-ago) — los dos papeles ADELGAZARON, y con ellos el buffer, de 28 a 12 KB:
 *   (a) el IDE manda trozos de 8 KB (BpvmClient.PUT_STREAM_CHUNK). Un cliente viejo
 *       que mandase más recibe NO_SPACE y se drena: se queja, no se corrompe.
 *   (b) el gestor ya no pide TRES sectores aquí: las dos copias del env se las presta
 *       la zona de rascar compartida (board_mgr_stm32.c) y de este buffer sale sólo el
 *       sector de trabajo + la respuesta = BP_ENV_SECTOR + reply.
 * El sector del env es la página de BORRADO y aquí son 8 KB (el doble que en
 * RP2350/ESP32), así que esta familia se queda en 12 KB donde las otras bajan a 8:
 * es el silicio, no una excepción. La comprobación EN COMPILACIÓN de abajo sigue
 * marcando el suelo: si alguien lo baja de más, no compila. */
#define V1_PUT_BUF_SIZE  (BP_ENV_SECTOR + 4096u)
static uint8_t s_put_buf[V1_PUT_BUF_SIZE];
typedef char bp_chk_put_buf[(V1_PUT_BUF_SIZE >= 8u*1024u &&
                             V1_PUT_BUF_SIZE >= BP_ENV_SECTOR + 512u) ? 1 : -1];
/* H13 hallazgo 31 (5-ago) — 128 KB era un DESCUIDO, no una decisión: se fijó al
 * nacer el port y nadie volvió a mirarlo. Medido sobre el ELF de la Nucleo: de
 * los 768 KB de RAM el estático total eran ~247 KB (128 de éstos) ⇒ ~520 KB
 * PARADOS, en la placa que tenía el heap MÁS PEQUEÑO del parque (64 KB, contra
 * 96 del S3 y 257 de la Pico). Con 512 KB la regla común (25 % pilas, suelo 64,
 * techo 512) reparte 384 de heap + 128 de pila.
 *
 * El presupuesto que lo justifica, para quien lo revise: 768 total − 512 aquí
 * − ~119 del resto del estático = ~137 KB libres, y el linker sólo exige 20
 * (_Min_Heap_Size 16K + _Min_Stack_Size 4K). Margen de 6×.
 *
 * Lo comparten LAS DOS placas de la familia y la que manda es la Nucleo: la
 * Discovery tiene 3008 KB de RAM, así que aquí le sobra. Si algún día se quiere
 * afinar por placa, el sitio es board.h — no este #define. */
/* V6/U6.12 — el tamaño lo pone CADA PLACA en board.h (BOARD_VM_BYTES): la Nucleo
 * sigue en 512 KB y la Discovery, con 3008 KB de RAM, pasa a 1536. «Quedarnos con
 * lo bueno y no unificar a lo peor» (Eduardo). */
static uint8_t s_vm_mem[BOARD_VM_BYTES];      /* RAM que gestiona la VM */
/* V6/U6.11 — lo que el planificador COMÚN (bpvm_mem) decidió sobre ese array.
 * Aquí no hay nada que medir en marcha: la región es el array entero, EXCLUSIVA
 * de la VM y SIN margen, porque el margen de esta familia lo pone el ENLAZADOR
 * (si `_Min_Heap_Size + _Min_Stack_Size` no caben detrás del estático, no enlaza,
 * y eso es más fuerte que cualquier comprobación en marcha). Pero la decisión y
 * la línea del log son las mismas que en las otras cuatro placas. 0 = sin plan. */
static size_t  s_vm_bytes = 0;
#define VM_MEM_MIN  (64u * 1024u)             /* el suelo de las cinco placas */
static char    s_out_esc[2048];               /* salida escapada (sink) */
static char    s_out_msg[2300];               /* evento OUTPUT completo */
static long    s_session = 0;                 /* contador de sesiones RUN */
static long    s_run_session = 0;             /* sesión activa (para el sink) */

/* ---- helpers de envío ---- */

static void reply_empty(const char* type, long id) {
    char buf[96];
    int n = snprintf(buf, sizeof(buf), "{\"type\":\"%s\",\"id\":%ld}", type, id);
    if (n > 0) wire_v1_send_line(buf, (size_t) n);
}

/* ---- META ---- */

/* V6/U3 g5 — HELLO vive en el común; lo propio va en la cintura, abajo. */

/* ── V6/U3 g4: LA CINTURA de esta familia ────────────────────────────────────
 * El REPL común pide los datos; aquí se dicen. Ver bpvm_repl.h para la forma
 * y la medida que la decidió (18 campos comunes, 11 sólo del RP2350). */

