legio-e/BasicPlus/bpgenvm-c/stm32/port/stm32_repl.c
static void stm32_repl_info(bpvm_repl_info_t* o) {
    /* N-stm32-info — DE DONDE SALE CADA VALOR de esta placa. El mensaje ya no
     * se arma aquí (lo hace src/bpvm_repl.c con los 18 campos comunes); esto
     * sólo los RELLENA, que es lo que de verdad es propio del STM32.
     * Valores del NUCLEO-U575ZI-Q (datasheet DS13737): flash 2 MB (sufijo
     * ZI), SRAM 768 KB, sin PSRAM. gpioCount=114 (I/Os del LQFP144).
     * pioCount=0 (PIO es RP2350-only). pwmSlices=28 — el campo lleva
     * SALIDAS PWM, como en los otros ports (Pico 24, ESP32 8): TIM1/TIM8
     * avanzados (4+4) + TIM2/3/4/5 GP (4×4) + TIM15 (2) + TIM16/17 (1+1),
     * sin contar complementarias ni los 4 LPTIM.
     * adcChannels=20 (ADC1 14-bit, "up to 20 multiplexed channels"; hay
     * además un ADC4 12-bit con 19 canales externos). Son datos del CHIP:
     * los backends BP de Pwm/Adc en STM32 aún no están cableados (H9 doc).
     * tempMilliC=0 (el diálogo oculta la línea; el sensor interno queda
     * para más adelante). FLASH_SIZE real del registro por si montan otra
     * variante. */
    static char uid[28];
    uint32_t u0 = *(volatile uint32_t*) (UID_BASE + 0U);
    uint32_t u1 = *(volatile uint32_t*) (UID_BASE + 4U);
    uint32_t u2 = *(volatile uint32_t*) (UID_BASE + 8U);
    snprintf(uid, sizeof uid, "%08lX%08lX%08lX",
             (unsigned long) u2, (unsigned long) u1, (unsigned long) u0);
    o->unique_id     = uid;
    o->board_name    = BOARD_NAME;
    o->reset_reason  = stm32_reset_cause();
    o->arch          = (unsigned) bpvm_mdn_host_arch();
    o->cpu_hz        = (unsigned long) SystemCoreClock;
    o->uptime_ms     = (unsigned long) HAL_GetTick();
    o->temp_milli_c  = 0;            /* sensor interno, para más adelante */
    o->gpio_count    = 114;          /* I/Os del LQFP144 */
    o->pio_count     = 0;            /* PIO es del RP2350 */
    o->pwm_slices    = 28;           /* salidas PWM, como cuentan los otros ports */
    o->adc_channels  = 20;
    o->flash_bytes   = (unsigned long) (*(volatile uint16_t*) FLASHSIZE_BASE) * 1024UL;
    o->sram_bytes    = BOARD_SRAM_BYTES;
    o->psram_bytes   = 0;
    /* V6/U6.11 — sobre lo PLANIFICADO, no sobre el sizeof: hoy coinciden (objetivo
     * 0 = el array entero) y, si un día dejan de coincidir, el INFO dirá la verdad. */
    {
        size_t vmb = s_vm_bytes;
        size_t pil = vmb ? bpvm_stack_region_bytes(vmb) : 0;
        o->vm_heap_bytes  = (unsigned long) (vmb - pil);
        o->vm_stack_bytes = (unsigned long) pil;
    }
    o->fs_total_bytes = (unsigned long) fs_total_bytes();
    o->fs_used_bytes  = (unsigned long) fs_used_bytes();
}

static unsigned long stm32_repl_fs_total(void) { return (unsigned long) fs_total_bytes(); }
static unsigned long stm32_repl_fs_used(void)  { return (unsigned long) fs_used_bytes(); }
static int           stm32_repl_fs_count(void) { return fs_count(); }
static int           stm32_repl_fs_format(void){ fs_format(); return 0; }
static int           stm32_repl_fs_save(void)  { fs_save(); return 0; }

/* El sello de compilación de ESTA familia. Ver la nota de `server_build` en
 * bpvm_repl.h: es la fecha de este fichero, no la del enlace — no identifica la
 * imagen por sí solo, pero es lo que había y no empeora al centralizar. */
static const char s_build[] = __DATE__ " " __TIME__;

/* Designados a propósito: la cintura va a crecer verbo a verbo, y con campos
 * posicionales meter uno en medio corre todos los de abajo en silencio — un
 * puntero a función acabaría llamándose por el hueco de otro. Ya nos pasó al
 * quitar un método de una base de la stdlib. */
/* Persistir sólo lo que sobrevive al reset de forma útil: /lib lo re-instala el
 * embebido en cada boot, así que un PUT a /lib (el IDE lo hace en cada Run) no
 * necesita flash → se ahorra un erase+program por ejecución. */
static void stm32_after_put(const char* path) {
    if (strncmp(path, "/lib/", 5) != 0) fs_save();
}

static const bpvm_repl_ops_t s_repl_ops = {
    .info          = stm32_repl_info,
    .info_extra    = NULL,     /* sin campos propios: los 18 comunes bastan */
    .server_name   = SERVER_NAME,
    .server_build  = s_build,
    .capabilities  = "[\"META\",\"FILES\",\"TERMINAL\",\"PACKS\"]",
    .fs_total_bytes= stm32_repl_fs_total,
    .fs_used_bytes = stm32_repl_fs_used,
    .fs_file_count = stm32_repl_fs_count,
    .fs_format     = stm32_repl_fs_format,
    .fs_save       = stm32_repl_fs_save,
    .put_buf       = s_put_buf,
    .put_buf_size  = sizeof s_put_buf,
    .after_put     = stm32_after_put,
};

/* ---- FILES ---- */

/* V6/U3 g3 — LIST vive en el común (streaming, crc:-1, montajes de la fachada). */





/* V6/U3 g5 — PUT vive en el común. Lo propio de esta familia son el scratch y
 * qué hacer después de una subida; ambos están en la cintura, abajo. */

/* V6/U3 g6 — #294 streaming PUT (BEGIN/DATA/END) vive en el común, con la
 * sesión y el scratch. Lo de esta familia sigue siendo el buffer y el
 * after_put, ya en la cintura. */


/* Sink que escapa cada chunk del log y lo escribe RAW → streaming como el Pico
 * (header + chunks + cierre), sin buffer para el log entero. */

/* V6/U3 — LOG_DUMP vive en el común (src/bpvm_repl.c). */
/* V6/U3 g2 — DEL/STAT/GET/MKDIR también (y RENAME/RMDIR, que esta familia no tenía). */

/* ---- TERMINAL: RUN + streaming ---- */

/* Cada PRINT_* de la VM llega aquí → evento OUTPUT con los bytes escapados. */
static void v1_output_sink(const char* s, size_t len, void* user) {
    (void) user;
    if (stm32_wire_json_escape(s, len, s_out_esc, sizeof(s_out_esc)) < 0) return;
    int n = snprintf(s_out_msg, sizeof(s_out_msg),
        "{\"type\":\"OUTPUT\",\"session\":%ld,\"stream\":\"stdout\",\"data\":\"%s\"}",
        s_run_session, s_out_esc);
    if (n > 0) wire_v1_send_line(s_out_msg, (size_t) n);
}

static void emit_exited(long session, const char* status, int code, uint32_t ms) {
    char buf[200];
    int n = snprintf(buf, sizeof(buf),
        "{\"type\":\"EXITED\",\"session\":%ld,\"status\":\"%s\",\"exitCode\":%d,"
        "\"elapsedMs\":%lu}", session, status, code, (unsigned long) ms);
    if (n > 0) wire_v1_send_line(buf, (size_t) n);
}

/* P-run-stop (#257) + P-autorun (#256) — wire durante el run (la VM
 * invoca el poll entre quanta; bare-metal single-thread → el poll puede
 * responder directamente):
 *   KILL  → ack diferido (KILL_REPLY tras parar, antes del EXITED) + 1.
 *   HELLO → HELLO_REPLY inmediato — el IDE puede conectarse con un
 *           (auto)run en marcha y ofrecer Stop.
 *   otra  → error BUSY inmediato. */
static long s_kill_ack_id = -1;
static long s_reset_ack_id = -1;   /* RESET recibido en-run (#452) */

/* El reinicio, en UN sitio: lo piden el despachador de reposo y —desde #452— el
 * final de un RUN que recibió RESET mientras corría. No retorna. */
static void stm32_hacer_reset(long id) {
    log_printf("RESET (wire): reinicio");
    log_flush();                 /* persiste la sesión antes de reiniciar */
    reply_empty("RESET_REPLY", id);
    HAL_Delay(50);
    NVIC_SystemReset();
}

/* V6/A1.5 - la costura de esta familia para el hilo `io`: su `poll` (el de
 * siempre) y su `line` (el sink de siempre, que ahora recibe lineas enteras en
 * vez de trozos). Nada mas; el lazo y el troceado son comunes. */
#define STM32_IO_OQ_BYTES 2048
static int stm32_run_poll_cb(bpvm_t* vm, void* user);
static int stm32_io_poll(void* user) {
    (void) user;
    return stm32_run_poll_cb(NULL, NULL);
}

static int stm32_run_poll_cb(bpvm_t* vm, void* user) {
    (void) vm; (void) user;
    int c = stm32_wire_getchar();
    if (c < 0) return 0;
    int n = wire_v1_recv_line(c, s_line, sizeof(s_line));
    if (n < 0) return 0;                      /* rota/estancada: descartar */
    json_obj_t obj;
    if (json_parse(s_line, (size_t) n, &obj) != 0) return 0;
    char type[24] = {0};
    json_get_str(&obj, "type", type, sizeof(type));
    long rid = json_get_long(&obj, "id", 0);
    if (strcmp(type, "KILL") == 0) { s_kill_ack_id = rid; return 1; }
    /* V6/E1 (#452) — RESET, con la MISMA forma que KILL. El enunciado de la ficha
     * era falso: RESET SÍ llegaba, y se rechazaba aquí a propósito con BUSY por no
     * tener rama. En dos tiempos: marcar el id y devolver 1 para que el RUN muera
     * por el camino de siempre, y reiniciar DESPUÉS, ya fuera de `bpvm_run`. */
    if (strcmp(type, "RESET") == 0) { s_reset_ack_id = rid; return 1; }
    if (strcmp(type, "HELLO") == 0) { bpvm_repl_dispatch(type, rid, &obj); return 0; }
    wire_v1_send_error(rid, "BUSY", "ejecución en curso: solo HELLO/KILL/RESET");
    return 0;
}

/* Resuelve un nombre de módulo en el FS: prueba base-dir/name, name, /app/name,
 * /lib/name (el IDE sube las deps a /lib). 0 OK, -1 no está.
 *
 * H11 — devuelve la RUTA que existe y su tamaño, NO los bytes. Antes resolvía a
 * un puntero, y sostenerlo costaba un espejo estático del tamaño de la arena del
 * FS viejo: 496 KB en la Discovery, 96 KB en la Nucleo. Ahora el llamante abre
 * por esa ruta y lee por trozos. Mismo cambio que #305 en el Pico. */
static int stm32_fs_resolve(const char* name, char* out, size_t out_cap, uint32_t* size) {
    /* #344 — la REGLA vive en el núcleo (bpvm_entry_resolve): basedir del
     * proyecto → tal cual → /app → /lib. Estas 15 líneas estaban COPIADAS
     * palabra por palabra en Pico, ESP32 y STM32; aquí ya sólo se traduce el
     * 0/-1 que espera el resto de este fichero. */
    return bpvm_entry_resolve(name, out, out_cap, size);
}

