legio-e/BasicPlus/bpgenvm-c/stm32/port/stm32_repl.c
/* Núcleo del RUN — compartido entre el comando RUN del wire (id >= 0)
 * y el autorun de boot (#256, id < 0). Con id < 0 no hay cliente: sin
 * RUN_REPLY, y una ruta inexistente enciende el LED rojo (el idioma de
 * diagnóstico de este port) en vez de mandar un error al vacío. */
static void run_module_path(const char* path, long id) {
    /* H19-F1 — fija el base-dir/main-module del proyecto si el módulo vive en
     * /app/<proj>/ (el IDE manda la ruta cualificada). Plano → sin base-dir. */
    bpvm_fs_set_basedir_from_module(path);
    char main_path[80]; uint32_t size;
    if (stm32_fs_resolve(path, main_path, sizeof(main_path), &size) != 0) {
        if (id >= 0) wire_v1_send_error(id, "NOT_FOUND", "no existe");
        else         BOARD_LED_ERR_ON();            /* autorun: ruta mala */
        return;
    }

    long session = ++s_session;
    s_run_session = session;
    if (id >= 0) { /* RUN_REPLY con la sesión, ANTES de ejecutar */
        char buf[80];
        int n = snprintf(buf, sizeof(buf),
            "{\"type\":\"RUN_REPLY\",\"id\":%ld,\"session\":%ld}", id, session);
        if (n > 0) wire_v1_send_line(buf, (size_t) n);
    }

    /* Antes pasaba 0 = 'default de bpvm_init' (mitad y mitad): la única de las
     * tres familias que ni siquiera tenía la regla. Ahora usa LA MISMA que Pico
     * y ESP32. Con 128 KB manda el suelo ⇒ 64/64, idéntico a hoy. */
    /* V6/U6.11 — el bloque es el que decidió el planificador en el arranque (hoy,
     * el array entero). Sin plan (NO_CABE) no hay VM y se dice: no se arranca a medias. */
    if (s_vm_bytes == 0) {
        log_printf("run: sin memoria planificada para la VM — no se ejecuta");
        BOARD_LED_ERR_ON(); emit_exited(session, "INTERNAL_ERROR", -1, 0); return;
    }
    size_t stack_region = bpvm_stack_region_bytes(s_vm_bytes);
    bpvm_t* vm = bpvm_init(s_vm_mem, s_vm_bytes, s_vm_bytes - stack_region);
    if (!vm) { BOARD_LED_ERR_ON(); emit_exited(session, "INTERNAL_ERROR", -1, 0); return; }
    bpvm_set_output(vm, v1_output_sink, NULL);

    uint32_t t0 = HAL_GetTick();
    BOARD_LED_RUN_ON();                           /* LED RUN = ejecutando un programa */
    /* #344 — UNA carga: bpvm_load_entry despacha .mod/.pack, lee por trozos
     * (H11: el .mod se queda en el FS), resuelve las dependencias con la regla
     * común —FS primero, y si no está, los packs grabados en XIP, código EN
     * FLASH y cero copia— y NOMBRA la que falte.
     *
     * De las tres familias ésta era la que MÁS tenía (era la única con packs y
     * con el guard anti-hard-fault), y es justo lo que se subió al núcleo: aquí
     * desaparecen ~70 líneas sin perder ni una capacidad. El guard sigue siendo
     * imprescindible en bare-metal — un CALL_EXT sin resolver cuelga el micro —
     * sólo que ahora lo hace `first_missing` para las cinco. */
    /* [V6/N1.4] EL VACIADO VA ANTES DE CARGAR. El registro AOT es global y hay
     * que tirar el del RUN anterior (los módulos se recargan en direcciones
     * frescas), pero desde que un `.mod` trae su bloque nativo dentro,
     * `bpvm_load_entry` YA REGISTRA thunks — y vaciar después los borraba.
     * No da error: se ejecuta interpretado y el resultado sale bien. Se vio en
     * la Pico el 23-ago, y sólo con el log encendido. */
    bpvm_aot_clear();

    bpvm_entry_t entry;
    memset(&entry, 0, sizeof entry);
    bpvm_status_t st = bpvm_load_entry(vm, path, &entry);
    char missing[40] = {0};
    if (entry.missing[0]) strncpy(missing, entry.missing, sizeof(missing) - 1);
    if (entry.from_pack)
        log_printf("run: pack '%s' (main=%s)", entry.resolved, entry.main_module);
    /* [25-ago] EL CAMINO DEL FALLO HABLA. Un RUN que moria en la carga dejaba
     * UNA linea en el log (el guardian de memoria, al destruir) y nada mas: ni
     * el status, ni el motivo, ni que fichero se estaba leyendo. Depurar eso
     * era adivinar — pregunta de Eduardo: "¿por que el log solo añade una linea
     * cuando en la Pico añade 12?". Esta linea es la respuesta al proximo. */
    if (st != BPVM_OK) {
        uint8_t m4[4] = {0};
        (void) bpvm_fs_read(main_path, m4, 4);   /* el MAGIC que vio el loader */
        log_printf("run: load '%s' FALLO st=%d fallo='%s' missing='%s' magic=%02X%02X%02X%02X",
                   path, (int) st, entry.fallo, missing, m4[0], m4[1], m4[2], m4[3]);
    }

    /* H9.5 — overlay AOT: para cada módulo cargado, si el FS tiene su
     * <Modulo>.mdn (PIC Thumb-2 de build_mdn.sh — mismo -mcpu=cortex-m33
     * que el RP2350, la U575 es el mismo core), registra sus thunks
     * zero-copy apuntando al buffer del FS (RAM, dirección estable durante
     * el RUN). El registry AOT es GLOBAL → clear antes de cada RUN para no
     * arrastrar thunks de una sesión anterior (buffers FS ya movidos).
     * Tolerante: sin .mdn o rc != OK → se ejecuta interpretado, sin más.
     * Nota U575: el código ejecuta desde SRAM (S-bus); el ICACHE del U5
     * cachea la ruta de flash (C-bus), así que no hace falta invalidación
     * — confirmar en placa con el primer smoke (fib_native).
     *
     * ⚠️ EL `bpvm_aot_clear()` YA NO ESTÁ AQUÍ — ver arriba, antes de la carga.
     * Desde [V6/N1.4] un `.mod` puede traer su bloque nativo DENTRO y el
     * cargador registra sus thunks durante `bpvm_load_entry`: vaciar el
     * registro después borraba justo eso. */
    if (st == BPVM_OK && !missing[0]) {
        for (int mi = 0; mi < vm->module_count; mi++) {
            const char* mname = vm->modules[mi].name;
            if (!mname || !mname[0]) continue;
            char mdn_path[72];   /* name[64] + ".mdn" + NUL: sin -Wformat-truncation */
            snprintf(mdn_path, sizeof(mdn_path), "%s.mdn", mname);
            char mdn_real[80]; uint32_t mdn_size;
            if (stm32_fs_resolve(mdn_path, mdn_real, sizeof(mdn_real), &mdn_size) != 0) continue;
            /* H11 — el .mdn es ZERO-COPY: los thunks se registran como punteros
             * DENTRO de este buffer, así que tiene que seguir vivo y en RAM toda
             * la ejecución. Antes vivía en el espejo del fs_get (la razón de que
             * el espejo fuera permanente y del tamaño de la arena); ahora se le
             * reserva de la arena de la VM exactamente lo que ocupa, 4-alineado
             * que es lo que pide Thumb-2. Mismo remedio que el Pico. */
            uint8_t* mdn_data = bpvm_arena_reserve(vm, mdn_size, 4);
            if (!mdn_data) {
                log_printf("AOT: %s (%lu B) no cabe en la arena — sin overlay",
                           mdn_real, (unsigned long) mdn_size);
                continue;
            }
            if (bpvm_fs_read(mdn_real, mdn_data, mdn_size) != (long) mdn_size) {
                log_printf("AOT: %s no se pudo leer — sin overlay", mdn_real);
                continue;
            }
            int mrc = bpvm_load_mdn(vm, mdn_data, (size_t) mdn_size);
            /* Visible en la consola del IDE: sin esto, un fallo de carga
             * (p.ej. buffer desalineado) caía a interpretado EN SILENCIO. */
            char mmsg[96];
            int mn = snprintf(mmsg, sizeof(mmsg), "[AOT] %s %s (rc=%d)\n",
                              mdn_path, (mrc == 0) ? "OK" : "FALLO -> interpretado", mrc);
            if (mn > 0) v1_output_sink(mmsg, (size_t) mn, NULL);
        }
    }

    /* P-run-stop (#257) — poll del wire entre quanta (KILL/HELLO/BUSY). */
    s_kill_ack_id = -1;
    s_reset_ack_id = -1;
    if (st == BPVM_OK && !missing[0]) bpvm_set_poll(vm, stm32_run_poll_cb, NULL);

    /* V6/A1.5 - EL HILO `io`, igual que en el PC, el ESP32 y la Pico.
     *
     * Mientras esta tarea (`vm`) ejecuta opcodes, `io` lee el wire y arma la
     * salida POR LINEAS. Aqui esto pesa mas que en ninguna otra placa: la UART
     * va a 115 200 baud y las 2 000 lineas de PrintBench costaban 71 357 ms
     * porque viajaban 820 018 bytes; con una linea por mensaje son ~239 KB.
     *
     * La cola, 2 KB: como el ESP32, que tambien sale por serie. Cuando se llena,
     * `vm` espera a que `io` drene, que es lo correcto - el programa no puede
     * producir mas deprisa de lo que traga el cable. */
    bpvm_io_ops_t io_ops = { stm32_io_poll, v1_output_sink, NULL };
    int con_io = (st == BPVM_OK && !missing[0])
                 && bpvm_io_start(vm, &io_ops, STM32_IO_OQ_BYTES) == 0;

    if (st == BPVM_OK && !missing[0]) st = bpvm_run(vm);
    BOARD_LED_RUN_OFF();

    /* Parar `io` ANTES de nada mas: drena la cola entera, asi que al volver de
     * aqui la ultima linea del programa YA salio por la UART, y el wire vuelve a
     * ser de esta tarea (que es quien manda KILL_REPLY y EXITED). */
    if (con_io) bpvm_io_stop(vm);
    uint32_t dt = HAL_GetTick() - t0;

    /* P-run-stop — ack diferido del KILL, antes del EXITED. */
    bpvm_set_poll(vm, NULL, NULL);
    if (s_kill_ack_id >= 0) { reply_empty("KILL_REPLY", s_kill_ack_id); s_kill_ack_id = -1; }

