legio-e/BasicPlus/bpgenvm-c/stm32/port/stm32_repl.c
    if (missing[0]) {
        BOARD_LED_ERR_ON();
        char buf[160];
        int n = snprintf(buf, sizeof(buf),
            "{\"type\":\"EXITED\",\"session\":%ld,\"status\":\"RUNTIME_ERROR\","
            "\"exitCode\":-2,\"elapsedMs\":0,"
            "\"errorMessage\":\"falta el modulo %s en el FS (stdlib no embebida?)\"}",
            session, missing);
        if (n > 0) wire_v1_send_line(buf, (size_t) n);
    } else if (st != BPVM_OK && entry.fallo[0]) {
        /* #421 (17-ago) — el PORQUÉ del fallo de CARGA, con su ruta. El resto
         * de familias lo mandaba desde el 16-ago y ésta seguía con el «IO
         * error» pelado — lo destapó el CENSO (docs/CENSO_FAMILIAS.md §5): el
         * patrón de siempre, el común creció y esta copia no. Va antes del
         * error de enlace porque un fichero que no se puede leer no llega a
         * enlazarse. */
        BOARD_LED_ERR_ON();
        char buf[288];
        int n = snprintf(buf, sizeof(buf),
            "{\"type\":\"EXITED\",\"session\":%ld,\"status\":\"RUNTIME_ERROR\","
            "\"exitCode\":%d,\"elapsedMs\":%lu,\"errorMessage\":\"load: %s\"}",
            session, (int) st, (unsigned long) dt, entry.fallo);
        if (n > 0) wire_v1_send_line(buf, (size_t) n);
    } else {
        if (st != BPVM_OK && st != BPVM_KILLED) BOARD_LED_ERR_ON();
        const char* link_err = bpvm_link_error(vm);   /* paso 4 — "" salvo fallo de link */
        if (link_err[0]) {
            char buf[320];
            int n = snprintf(buf, sizeof(buf),
                "{\"type\":\"EXITED\",\"session\":%ld,\"status\":\"LINK_ERROR\","
                "\"exitCode\":%d,\"elapsedMs\":%lu,\"errorMessage\":\"%s\"}",
                session, (int) st, (unsigned long) dt, link_err);
            if (n > 0) wire_v1_send_line(buf, (size_t) n);
        } else {
            /* #406 — el DETALLE del error de ejecucion, no solo la categoria.
             *
             * Esta familia se habia quedado corta: el Pico y los ESP32 ya
             * miraban bpvm_runtime_error() y el STM32 solo trataba link_err, asi
             * que en el IDE salia «RUNTIME_ERROR» pelado y el texto —el motivo
             * real— se perdia. Es el patron de siempre: el comun crecio y una
             * copia privada no.
             *
             * El mensaje lo rellena la VM tanto si el error lo lanza ella como
             * si es un `throw` de clase de usuario sin atrapar (eso ultimo es lo
             * que anadio #406 en src/exceptions.c). */
            const char* rt_err = bpvm_runtime_error(vm);
            if (st != BPVM_OK && st != BPVM_KILLED && rt_err[0]) {
                char buf[320];
                int n = snprintf(buf, sizeof(buf),
                    "{\"type\":\"EXITED\",\"session\":%ld,\"status\":\"RUNTIME_ERROR\","
                    "\"exitCode\":%d,\"elapsedMs\":%lu,\"errorMessage\":\"%s\"}",
                    session, (int) st, (unsigned long) dt, rt_err);
                if (n > 0) wire_v1_send_line(buf, (size_t) n);
            } else {
                emit_exited(session,
                            (st == BPVM_OK)     ? "OK"
                          : (st == BPVM_KILLED) ? "KILLED" : "RUNTIME_ERROR",
                            (st == BPVM_KILLED) ? 130 : (int) st, dt);
            }
        }
    }
    bpvm_destroy(vm);

    /* V6/E1 (#452) — el RESET pedido durante el RUN, servido AHORA: el EXITED ya
     * salió, así que el IDE ve la secuencia entera en vez de un BUSY. No retorna. */
    if (s_reset_ack_id >= 0) {
        long rid = s_reset_ack_id;
        s_reset_ack_id = -1;
        stm32_hacer_reset(rid);
    }
}

static void handle_run(long id, json_obj_t* obj) {
    char path[64];
    if (json_get_str(obj, "path", path, sizeof(path)) < 0) {
        wire_v1_send_error(id, "INVALID_PATH", "missing path"); return;
    }
    run_module_path(path, id);
}

/* P-autorun (#256) — si existe /sys/auto.txt, ejecuta el módulo de su
 * primera línea por el mismo camino que un RUN del wire. El poll del
 * run atiende HELLO/KILL → el IDE puede conectar y parar la app. */
/* #345 paso 2 — cintura del gate. Cuatro funciones y ni un verbo nuevo: el
 * HELLO que el IDE ya manda al conectar dice "hay alguien", y el KILL que ya
 * manda el Stop dice "no arranques". La política está en el núcleo. */
static void stm32_autorun_anuncia(const char* path, int ventana_ms, void* user) {
    (void) user;
    log_printf("autorun: %s arranca en %d ms — Stop en el IDE para cancelar",
               path, ventana_ms);
}

static int stm32_autorun_escucha(void* user) {
    (void) user;
    int c = stm32_wire_getchar();
    if (c < 0) return 0;                       /* nada pendiente */
    int n = wire_v1_recv_line(c, s_line, sizeof(s_line));
    if (n < 0) return 1;                       /* línea rota, pero HAY alguien */
    json_obj_t obj;
    if (json_parse(s_line, (size_t) n, &obj) != 0) return 1;
    char type[24] = {0};
    json_get_str(&obj, "type", type, sizeof(type));
    long rid = json_get_long(&obj, "id", 0);
    if (strcmp(type, "KILL") == 0) { reply_empty("KILL_REPLY", rid); return 2; }
    if (strcmp(type, "HELLO") == 0) { bpvm_repl_dispatch(type, rid, &obj); return 1; }
    return 1;                                  /* hay alguien: basta con eso */
}

static void stm32_autorun_espera(int ms, void* user) {
    (void) user; HAL_Delay((uint32_t) ms);
}

static uint32_t stm32_autorun_ahora(void* user) {
    (void) user; return HAL_GetTick();
}

static const bpvm_autorun_wire_t s_autorun_wire = {
    stm32_autorun_anuncia, stm32_autorun_escucha,
    stm32_autorun_espera,  stm32_autorun_ahora, NULL
};

static void autorun_boot(void) {
    /* #345 — leer y limpiar la primera línea lo hace el núcleo. (H11 sigue
     * valiendo: sólo la CABEZA del fichero, nunca un espejo.) */
    char path[64];
    if (!bpvm_autorun_entry(path, sizeof path)) return;   /* sin autorun */

    /* #345 paso 2 — la ventana de rescate. Decide el usuario. */
    if (!bpvm_autorun_gate(&s_autorun_wire, path, 500, 10000)) {
        log_printf("autorun: CANCELADO por el usuario (Stop) — REPL normal");
        return;
    }
    log_printf("autorun: %s", path);
    run_module_path(path, -1);
}

/* ---- dispatch ---- */

static void dispatch(int first_char) {
    int len = wire_v1_recv_line(first_char, s_line, sizeof(s_line));
    if (len == -2) return;   /* línea estancada: silencio; el IDE reintenta */
    if (len < 0)  { stm32_wire_send_fatal("PROTOCOL_ERROR", "line too long"); return; }

