legio-e/BasicPlus/bpgenvm-c/stm32/port/stm32_repl.c
    json_obj_t obj;
    if (json_parse(s_line, (size_t) len, &obj) != 0) {
        stm32_wire_send_fatal("PROTOCOL_ERROR", "bad JSON"); return;
    }
    long id = json_get_long(&obj, "id", 0);
    char type[40];
    if (json_get_str(&obj, "type", type, sizeof(type)) < 0) {
        wire_v1_send_error(id, "PROTOCOL_ERROR", "missing type"); return;
    }

    /* H9 — gestión de placa (STATE/ENV_x/PART_x + H3 PACK_x): el host configura el
     * env/particiones cuando el arranque no llegó al FS, y consulta/graba la zona
     * de packs. Las replies las pone bpvm_bmgr_wire (idénticas al boardsim y a las
     * otras placas). s_put_buf presta el scratch; el bulk de PACK_BURN_DATA va a
     * su buffer propio (chunk ≤ 4K) para no pisar el scratch. */
    if (strcmp(type, "STATE") == 0
        || strncmp(type, "ENV_", 4) == 0
        || strncmp(type, "PART_", 5) == 0
        || strncmp(type, "PACK_", 5) == 0) {
        static uint8_t s_burn_chunk[BPVM_PACK_BURN_CHUNK];
        const uint8_t* bulk_ptr = NULL;
        unsigned long  bulk_n   = 0;
        long bulk = json_get_long(&obj, "bulk", -1);
        if (bulk > 0) {
            /* CRÍTICO: consumir SIEMPRE los bytes anunciados (como el PUT) para
             * no desincronizar el wire, quepan o no. */
            if ((size_t) bulk > sizeof s_burn_chunk) {
                size_t rem = (size_t) bulk;
                while (rem > 0) {
                    size_t chunk = rem < sizeof s_burn_chunk ? rem : sizeof s_burn_chunk;
                    if (wire_v1_recv_bulk(s_burn_chunk, chunk, sizeof s_burn_chunk) < 0) {
                        stm32_wire_send_fatal("PROTOCOL_ERROR", "bulk underrun"); return;
                    }
                    rem -= chunk;
                }
                wire_v1_send_error(id, "INVALID_PARAM", "chunk demasiado grande");
                return;
            }
            if (wire_v1_recv_bulk(s_burn_chunk, (size_t) bulk, sizeof s_burn_chunk) < 0) {
                stm32_wire_send_fatal("PROTOCOL_ERROR", "bulk underrun"); return;
            }
            bulk_ptr = s_burn_chunk;
            bulk_n = (unsigned long) bulk;
        }
        board_mgr_stm32_handle(id, &obj, type, s_put_buf, sizeof s_put_buf, bulk_ptr, bulk_n);
        return;
    }
    /* H9 — gating: sin FS montado, las ops de fichero no valen; sin VM, el RUN no.
     * HELLO/INFO/STATE/PING/TIME/RESET van SIEMPRE (para conectar y configurar). */
    {
        int st = (int) board_boot_status()->state;
        int is_fs = (strcmp(type, "LIST")  == 0 || strcmp(type, "STAT") == 0 || strcmp(type, "DF")  == 0
                  || strcmp(type, "GET")   == 0 || strcmp(type, "PUT")  == 0 || strcmp(type, "DEL") == 0
                  || strncmp(type, "PUT_", 4) == 0   /* #294 streaming: PUT_BEGIN/DATA/END */
                  || strcmp(type, "MKDIR") == 0 || strcmp(type, "FORMAT") == 0
                  || strcmp(type, "RENAME") == 0 || strcmp(type, "RMDIR") == 0);
                  /* V6/U3 g2: RENAME/RMDIR entran por el común, pero el gate
                   * de FS-no-montado es de esta familia y debe cubrirlos. */
        if (is_fs && st < BPVM_BOOT_FS) {
            /* El bulk que esta puerta rechaza hay que TRAGARSELO igual, o se
             * queda en el cable y el mensaje siguiente se lee desde la mitad.
             * Aquí no lo ha leído nadie todavía: el bloque de PACK_* retorna
             * antes de llegar a esta puerta. */
            long b_pend = json_get_long(&obj, "bulk", 0);
            if (b_pend > 0) (void) bpvm_repl_drain_bulk((unsigned long) b_pend);
            wire_v1_send_error(id, "NOT_READY", "FS no montado (configura particiones)");
            return;
        }
        if (strcmp(type, "RUN") == 0 && st < BPVM_BOOT_APP) {
            wire_v1_send_error(id, "NOT_READY", "VM no lista (configura particiones)");
            return;
        }
    }

    /* V6/U3 — PRIMERO el común: PING/TIME/LOG_DUMP/LOG_CLEAR viven en
     * src/bpvm_repl.c para las cuatro familias. Si lo atiende, hemos acabado.
     * Los verbos de esta familia siguen debajo y van migrando por grupos. */
    if (bpvm_repl_dispatch(type, id, &obj)) return;

    else if (strcmp(type, "RUN")       == 0) handle_run(id, &obj);
    /* P-run-stop (#257) — KILL en idle: nada que matar (el útil llega
     * DURANTE un RUN y lo atiende stm32_run_poll_cb). */
    else if (strcmp(type, "KILL")      == 0)
        wire_v1_send_error(id, "NO_SESSION", "no hay programa en ejecución");
    else if (strcmp(type, "RESET")     == 0) { stm32_hacer_reset(id); }
    else {
        char msg[96];
        snprintf(msg, sizeof(msg), "type '%s' no implementado (H9.2)", type);
        wire_v1_send_error(id, "UNSUPPORTED", msg);
    }
}

/* #353 — sink de diagnóstico de la VM: al log persistente. */
static void diag_al_log(const char* linea) { log_printf("%s", linea); }

/* V6/U6.11 — ENUMERAR, PLANIFICAR, TOMAR: la misma terna que Pico y ESP32, sobre
 * la memoria más simple del parque. La familia ofrece UNA región: el array
 * estático, exclusivo de la VM (nadie más asigna en él) y sin margen — lo que se
 * deja a malloc y a la pila del MSP no se lo deja la VM: lo exige el enlazador
 * (`._user_heap_stack`). Objetivo 0 = el array entero; suelo, el de las demás.
 * El número es el de siempre (512 KB → 384 de heap + 128 de pilas por la regla
 * común), pero decidido y CONTADO con la misma función y la misma línea que las
 * otras cuatro placas — y `test_mem` lo fija con este caso. */
/* V6/U4 — lo propio de esta familia para el instalador común: el put y el log. */
static int  stm32_mods_put(const char* p, const uint8_t* d, uint32_t n) { return fs_put(p, d, n) == 0 ? 0 : -1; }
static void stm32_mods_log(const char* l) { log_printf("%s", l); }

static int stm32_mem_regiones(bpvm_mem_region_t* out, int max) {
    if (max < 1) return 0;
    out[0].base      = s_vm_mem;
    out[0].bytes     = sizeof s_vm_mem;
    out[0].libre     = sizeof s_vm_mem;      /* un solo bloque: lo contiguo ES el total */
    out[0].exclusiva = 1;
    out[0].margen    = 0;                    /* el margen lo puso el enlazador, no la VM */
    out[0].nombre    = "SRAM estática";
    return 1;
}

static void stm32_mem_planificar(void) {
    bpvm_mem_region_t reg[1];
    int nreg = stm32_mem_regiones(reg, 1);
    bpvm_mem_cfg_t cfg;
    cfg.objetivo       = 0;                  /* todo lo que el plan deje: el array entero */
    cfg.vm_min         = VM_MEM_MIN;
    cfg.reserva_bytes  = 0;                  /* sin SQLite en SRAM: no hay reserva con nombre */
    cfg.reserva_nombre = NULL;
    bpvm_mem_plan_t plan;
    bpvm_mem_plan(reg, nreg, &cfg, &plan);
    char linea[160];
    bpvm_mem_plan_str(&plan, reg, &cfg, linea, sizeof linea);
    log_printf("%s", linea);
    s_vm_bytes = (plan.res == BPVM_MEM_OK) ? plan.bytes : 0;
}

void stm32_repl_run(void) {
    /* H9 — arranque ESCALONADO: identidad → particiones del env → FS → VM, parando
     * en la 1ª capa que falla. Sin particiones/FS el climb se queda abajo y el host
     * conduce (Gestión de placa: proponer defaults → aplicar → reset). Sustituye al
     * fs_load() de región fija. */
    log_init();                     /* recupera el log de la sesión anterior (post-mortem) */
    /* #439 — y DE DONDE sale lo recuperado: sin esto, un volcado con dos
     * arranques no distingue «la RAM sobrevivio al reset» de «se cargo de
     * flash lo que el arranque anterior volco». */
    log_printf(bpvm_log_origen_ram()
               ? "log: RAM SUPERVIVIENTE (lineas de ANTES del reset)"
               : "log: arranque en frio (cargado de flash)");
    stm32_mem_planificar();         /* V6/U6.11 — la línea `vm:` de las cinco placas, al abrir el boot */
    /* #353 — lo que dice la VM (deps que faltan, packs, veredicto del guardián
     * de #339) al log. Aquí el problema era el opuesto al de la Pico: sin un
     * `_write` retargeteado, el stderr del núcleo se PERDÍA. Esto devuelve al
     * log los avisos de pack que este port tenía a mano antes de #344. */
    bpvm_repl_set_ops(&s_repl_ops);   /* V6/U3 g4: la cintura, antes del primer mensaje */
    bpvm_diag_set_sink(diag_al_log);
    board_mgr_stm32_boot();
    const bpvm_boot_status_t* bs = board_boot_status();
    log_printf("boot: estado %d (%s)%s%s", (int) bs->state, bpvm_boot_state_name(bs->state),
               bs->degraded ? " DEGRADED: " : "", bs->degraded ? bs->reason : "");
    /* stdlib core embebida en /lib SOLO con el FS montado (si el climb no llegó al
     * FS, no hay dónde instalarla; el host configura particiones primero). */
    if (bs->state >= BPVM_BOOT_FS) {
        /* V6/U4 — la stdlib embebida a /lib: tabla GENERADA (stm32_mods.c, sólo
         * datos); bucle y regla (#466) en src/bpvm_mods.c; aquí sólo el put. */
        (void) bpvm_mods_instalar_tabla(stm32_mods, stm32_mods_n, stm32_mods_put, stm32_mods_log);
        stm32_fs_register_bpvm();   /* #247 — readFile/writeFile/... sobre el FS */
        log_printf("fs: %u/%u bytes usados", (unsigned) fs_used_bytes(),
                   (unsigned) fs_total_bytes());
    }
    stm32_hw_register();            /* backends de HW (GPIO, info de MCU) — siempre */
    log_flush();                    /* persiste la historia del boot (post-mortem tras corte) */

    /* FIFO RX/TX (8 bytes): absorbe el hueco de procesado entre la línea JSON
     * y los bytes bulk que la siguen → PUT fiable aunque la CPU vaya lenta.
     * (El fix definitivo del timing es subir el reloj a 160 MHz.) */
    HAL_UARTEx_SetTxFifoThreshold(BOARD_WIRE_UART, UART_TXFIFO_THRESHOLD_1_8);
    HAL_UARTEx_SetRxFifoThreshold(BOARD_WIRE_UART, UART_RXFIFO_THRESHOLD_1_8);
    HAL_UARTEx_EnableFifoMode(BOARD_WIRE_UART);

#if defined(BOARD_WIRE_IRQn)
    /* RX por IRQ → ring (V3/H5.2 DK2; H10 también Nucleo). La FIFO de 8B (≈700µs)
     * no basta cuando el lazo deja el UART sin sondear ms (bombeo de LVGL en
     * Gui.run()) y se perdían los primeros bytes del KILL. Con la IRQ drenando a un
     * ring de 256B, getchar() no pierde nada y el GUI puede dormir entre frames
     * (__WFI). Tras EnableFifoMode para que RXFNE refleje la FIFO ya activa.
     * La placa opta definiendo BOARD_WIRE_IRQn en board.h. */
    stm32_wire_rx_irq_enable();
#endif

    wire_v1_send_cstr("=== bpvm-stm32 REPL (wire v1) listo ===");
    {   /* H10 — causa del último reset (diagnóstico; revela WDT/soft/power-on). */
        char rc[64];
        snprintf(rc, sizeof(rc), "reset cause: %s", stm32_reset_cause());
        wire_v1_send_cstr(rc);
    }

    /* P-autorun (#256) — el wire ya está vivo: si la app de auto.txt se
     * queda en bucle, el IDE puede conectar (HELLO) y matarla (KILL). */
    /* #423 — A PARTIR DE AQUI, EL LOG LO MANDA EL ENTORNO (`log=0|1`).
     * Mismo punto que en las otras familias: el arranque entero se registra
     * siempre (son ~15 lineas y hacen falta cuando una placa no arranca) y lo
     * que se apaga es el rastro de EJECUCION, que es el que llena la region.
     * Por defecto APAGADO: `log=1` cuando se va a depurar. */
    /* `stack=N` (KB) — el usuario reparte el bloque entre pilas y heap; ausente
     * o 0 = el reparto de siempre. Mismo sitio y misma clave que en las otras
     * familias: la regla vive en bpvm_stack_region_bytes(). Va aquí, ANTES del
     * primer RUN, que es quien llama a bpvm_init. */
    bpvm_set_stack_kb((unsigned long) board_mgr_stm32_env_long("stack", 0));
    bpvm_set_quantum_ops(board_mgr_stm32_env_long("quantum", 0));   /* #462 */

    bpvm_log_set_enabled(board_mgr_stm32_env_bool("log", 0));

    autorun_boot();

    uint32_t last_blink = HAL_GetTick();
    for (;;) {
        int c = stm32_wire_getchar();
        if (c == '{') dispatch(c);

        uint32_t now = HAL_GetTick();
        if (now - last_blink >= 500U) {     /* heartbeat */
            last_blink = now;
            BOARD_LED_BEAT_TOGGLE();
        }
    }
}
